Python - MySQL
1. MySQL Python connector


Prerequisites:
Root or Administrator privileges in order to perform the installation.
Python installed on your system

Installation
pip install mysql-connector-python

# If you found any issue while installing, you can explicitly specify the module version as follows:
pip install mysql-connector-python==8.0.17

In [2]:
## importing 'mysql.connector' as mysql 
import mysql.connector as mysql

In [3]:
mysql.__version__

'8.0.32'

## 2. Connect to a MySQL Database in Python

In [4]:
pwd_file = r'C:\Users\HP\Desktop\class\SQL\day9\password.txt'

In [5]:
with open(pwd_file) as f:
    root_pwd = f.read()

In [6]:
## connecting to the server using 'connect()' method
## syntax: mysql.connect(host = 'host name', user='user name', password= 'password')
db = mysql.connect(host = 'localhost', user ='root' , password =root_pwd )

In [7]:
print(db) # it will print a connection object if everything is fine

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002620B77D490>

If you see the following output, it means that you have been successfully installing the MySQL Connector/Python on your system.

<mysql.connector.connection_cext.CMySQLConnection at 0x10dbe1c8ee0>

In [8]:
type(db)

mysql.connector.connection_cext.CMySQLConnection

3. Manage Databases

In [9]:
## creating an instance of 'cursor' class which is used to execute the 'SQL' statements in 'Python'

cursor = db.cursor()

In [10]:
type(cursor)

mysql.connector.cursor_cext.CMySQLCursor

In [11]:
# executing the statement using 'execute()' method
cursor.execute('SHOW DATABASES')

In [12]:
# 'fetchall()' method fetches all the rows from the last executed statement
databases = cursor.fetchall()

In [13]:
print(databases)

[('codify',), ('demo',), ('information_schema',), ('lecab',), ('museum',), ('music',), ('mysql',), ('performance_schema',), ('retail',), ('student',), ('sys',), ('test',), ('testdb',)]

In [14]:
for i in databases:
    print(i)

('codify',)
('demo',)
('information_schema',)
('lecab',)
('museum',)
('music',)
('mysql',)
('performance_schema',)
('retail',)
('student',)
('sys',)
('test',)
('testdb',)

In [15]:
# Drop a Database

cursor.execute('DROP DATABASE IF EXISTS testdb')

In [16]:
# Create a Database

cursor.execute('CREATE DATABASE testdb')

4. crating table

In [38]:
## connecting to the database using 'connect()' method

db = mysql.connect(host = 'localhost', user = 'root', password = root_pwd, database = 'testdb')

In [39]:
print(db)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002620B77DCA0>

In [40]:
cursor = db.cursor()

In [33]:
# getting all the tables 
cursor.execute('SHOW TABLES')

In [34]:
# 'fetchall()' method fetches all the rows from the last executed statement
cursor.fetchall()

[('sales',)]

In [35]:
create_query = '''DROP TABLE IF EXISTS sales;

CREATE TABLE sales(
    sales_employee VARCHAR(50) NOT NULL,
    fiscal_year INT NOT NULL,
    sale DECIMAL(14,2) NOT NULL,
    PRIMARY KEY(sales_employee,fiscal_year)
);'''

In [36]:
cursor.execute(create_query)

In [41]:
cursor.execute('SHOW TABLES')

In [43]:
# close the cursor

cursor.close()

InternalError: Unread result found

In [44]:
db = mysql.connect(host = 'localhost', user = 'root', password = root_pwd, database = 'testdb')

In [45]:
cursor = db.cursor()

In [46]:
cursor.execute('SHOW TABLES')

In [47]:
cursor.fetchall()

[('sales',)]

5. Insert data into table

In [48]:
insert_query = '''INSERT INTO sales(sales_employee,fiscal_year,sale)
VALUES('Bob',2016,100)'''

Close the cursor and open it again before using it to execute another statement, in case of error.

In [49]:
# close the cursor

cursor.close()

True

In [50]:
db = mysql.connect(host = 'localhost', user = 'root', password = root_pwd, database = 'testdb')
cursor = db.cursor()

In [51]:
cursor.execute(insert_query)

In [52]:
select_query = 'SELECT * FROM sales'

In [53]:
cursor.execute(select_query)

In [54]:
cursor.fetchall()

[('Bob', 2016, Decimal('100.00'))]

In [55]:
# Insert multiple records

insert_query = '''INSERT INTO sales(sales_employee,fiscal_year,sale)
VALUES
      ('Bob',2017,150),
      ('Bob',2018,200),
      ('Alice',2016,150),
      ('Alice',2017,100),
      ('Alice',2018,200),
       ('John',2016,200),
      ('John',2017,150),
      ('John',2018,250);'''

In [56]:
cursor.execute(insert_query)

In [57]:
cursor.execute(select_query)

In [58]:
cursor.fetchall()

[('Alice', 2016, Decimal('150.00')),
 ('Alice', 2017, Decimal('100.00')),
 ('Alice', 2018, Decimal('200.00')),
 ('Bob', 2016, Decimal('100.00')),
 ('Bob', 2017, Decimal('150.00')),
 ('Bob', 2018, Decimal('200.00')),
 ('John', 2016, Decimal('200.00')),
 ('John', 2017, Decimal('150.00')),
 ('John', 2018, Decimal('250.00'))]

In [59]:
cursor.execute(select_query)

In [60]:
data = cursor.fetchall()

In [61]:
type(data)

list

In [62]:
data[0]

('Alice', 2016, Decimal('150.00'))

In [63]:
data[1][0]

'Alice'

In [64]:
cursor.execute('COMMIT')

In [65]:
cursor.execute('set autocommit = 1')

6. Update the data in the table

In [66]:
update_query = "UPDATE sales SET sale = 1500 WHERE sales_employee = 'Alice' AND fiscal_year = 2016"

In [67]:
cursor.execute(update_query)

In [68]:
cursor.execute(select_query)

In [69]:
cursor.fetchall()

[('Alice', 2016, Decimal('1500.00')),
 ('Alice', 2017, Decimal('100.00')),
 ('Alice', 2018, Decimal('200.00')),
 ('Bob', 2016, Decimal('100.00')),
 ('Bob', 2017, Decimal('150.00')),
 ('Bob', 2018, Decimal('200.00')),
 ('John', 2016, Decimal('200.00')),
 ('John', 2017, Decimal('150.00')),
 ('John', 2018, Decimal('250.00'))]

7. Delete records in a table

In [70]:
delete_query = ''' DELETE FROM sales WHERE sale = 150'''

In [71]:
cursor.execute(delete_query)

In [72]:
cursor.execute(select_query)

In [73]:
cursor.fetchall()

[('Alice', 2016, Decimal('1500.00')),
 ('Alice', 2017, Decimal('100.00')),
 ('Alice', 2018, Decimal('200.00')),
 ('Bob', 2016, Decimal('100.00')),
 ('Bob', 2018, Decimal('200.00')),
 ('John', 2016, Decimal('200.00')),
 ('John', 2018, Decimal('250.00'))]

8. Call Stored Procedures

In [74]:
# close the cursor

cursor.close()

True

In [75]:
db = mysql.connect(host = 'localhost', user = 'root', password = root_pwd, database = 'student')
cursor = db.cursor()

In [76]:
call_sp_query = 'CALL GetAllStudents'

In [77]:
cursor.execute(call_sp_query)

In [78]:
cursor.fetchall()

[(1, 'Kiran Kumar', 23, 'Male', 'Data Science', Decimal('23000.00')),
 (2, 'Anirudh reddy', 20, 'Male', 'Data Science', Decimal('50000.00')),
 (3, 'Bhargavi', 22, 'Female', 'Data Analysis', Decimal('40000.00')),
 (4, 'Dharani', 20, 'Female', 'Data Analysis', Decimal('50000.00')),
 (5, 'gopal', 25, 'Male', 'SQL module', Decimal('50000.00')),
 (6,
  'lasya Sharma',
  22,
  'female',
  'Data Analysis and Data Science',
  Decimal('50000.00')),
 (7, 'Jagdeesh', 25, 'Male', 'Machine Learning', Decimal('93490.00')),
 (8, 'Manasa', 22, 'Female', 'Data Analysis', Decimal('60000.00')),
 (9, 'Neharika', 19, 'Female', 'Machine Learning', Decimal('20000.00')),
 (10, 'Nelofar', 20, 'female', 'Data Science', Decimal('50000.00')),
 (11, 'Nikhil Kumar', 18, 'Male', 'Data Science', Decimal('10000.00')),
 (12, 'Praneeth', 26, 'Male', 'Data Analysis', Decimal('44000.00')),
 (13, 'Praveen', 30, 'Male', 'Data Science', Decimal('50000.00')),
 (14,
  'Rakesh',
  27,
  'Male',
  'Data Science and Data Analysis',
  Decimal('66000.00')),
 (15, 'Rasagna Chiluka', 36, 'Male', 'Data Science', Decimal('20000.00')),
 (16, 'rubyna', 23, 'Feale', 'Web Scrapping', Decimal('10000.00')),
 (17, 'Sai Kumar', 28, 'Male', 'Web Scrapping', Decimal('20000.00')),
 (18, 'Shivanisaindla', 34, 'Female', 'Data Analysis', Decimal('44000.00')),
 (19, 'Sirajuddin Shoaib', 28, 'Male', 'Data Science', Decimal('98000.00')),
 (20, 'Suman Nayak', 22, 'Male', 'Data Analysis', Decimal('40000.00')),
 (21, 'Suryaa', 29, 'Male', 'Data Science', Decimal('90000.00')),
 (22, 'Varsha Phebe', 32, 'Female', 'Data Science', Decimal('84000.00')),
 (23, 'Vipin', 22, 'Male', 'Web Scrapping', Decimal('20000.00')),
 (24, 'Yash', 29, 'Male', 'Web Scrapping', Decimal('20000.00')),
 (25, 'Zayed Shaik', 31, 'Male', 'Web Scrapping', Decimal('10000.00')),
 (26, 'Archana', 23, 'Feale', 'Data Science', Decimal('24000.00')),
 (27,
  'Bakkayolla Yashwanth',
  24,
  'Male',
  'Data Analysis',
  Decimal('54000.00')),
 (28, 'Bhani Cilver', 29, 'Female', 'Data Science', Decimal('44000.00')),
 (29, 'Bhavani', 20, 'Male', 'Web Scrapping', Decimal('50000.00')),
 (30, 'Bhavya', 25, 'Female', 'SQL module', Decimal('34000.00')),
 (31,
  'Deepak Gudipudi',
  52,
  'Male',
  'Data Analysis and Data Science',
  Decimal('99000.00')),
 (32, 'Jawad', 23, 'Male', 'Data Analysis', Decimal('8342.00')),
 (33, 'Vikas', 20, 'Male', 'Machine Learning', Decimal('93420.00')),
 (34, 'Madhu', 21, 'Male', 'Data Analysis', Decimal('68000.00')),
 (35,
  'Nheha Chaturvedi',
  19,
  'Female',
  'Machine Learning',
  Decimal('43000.00')),
 (36, 'Nheha Reddy', 21, 'Female', 'Data Science', Decimal('80000.00')),
 (37,
  'Pravallika',
  19,
  'Female',
  'Data Analysis and Data Science',
  Decimal('60000.00')),
 (38, 'Ravikrishna', 20, 'Female', 'Data Analysis', Decimal('40000.00')),
 (39, 'Sreeram', 30, 'Male', 'Web Scrapping', Decimal('90000.00')),
 (40, 'Venkata Narasimha', 23, 'Male', 'Data Science', Decimal('70000.00')),
 (44, 'Harjas', 24, 'Male', 'Data Analysis', Decimal('40000.00')),
 (45, 'Manoj', 25, 'Male', 'Data Science', Decimal('80000.00'))]

In [85]:
call_sp_query = 'CALL GetStubyCourse(\'Data Science\')'

In [80]:
cursor.close()

True

In [86]:
db = mysql.connect(host = 'localhost', user = 'root', password = root_pwd, database = 'student')
cursor = db.cursor()

In [87]:
cursor.execute(call_sp_query)

In [88]:
cursor.fetchall()

[(1, 'Kiran Kumar', 23, 'Male', 'Data Science', Decimal('23000.00')),
 (2, 'Anirudh reddy', 20, 'Male', 'Data Science', Decimal('50000.00')),
 (10, 'Nelofar', 20, 'female', 'Data Science', Decimal('50000.00')),
 (11, 'Nikhil Kumar', 18, 'Male', 'Data Science', Decimal('10000.00')),
 (13, 'Praveen', 30, 'Male', 'Data Science', Decimal('50000.00')),
 (15, 'Rasagna Chiluka', 36, 'Male', 'Data Science', Decimal('20000.00')),
 (19, 'Sirajuddin Shoaib', 28, 'Male', 'Data Science', Decimal('98000.00')),
 (21, 'Suryaa', 29, 'Male', 'Data Science', Decimal('90000.00')),
 (22, 'Varsha Phebe', 32, 'Female', 'Data Science', Decimal('84000.00')),
 (26, 'Archana', 23, 'Feale', 'Data Science', Decimal('24000.00')),
 (28, 'Bhani Cilver', 29, 'Female', 'Data Science', Decimal('44000.00')),
 (36, 'Nheha Reddy', 21, 'Female', 'Data Science', Decimal('80000.00')),
 (40, 'Venkata Narasimha', 23, 'Male', 'Data Science', Decimal('70000.00')),
 (45, 'Manoj', 25, 'Male', 'Data Science', Decimal('80000.00'))]